## SETUP

In [1]:
#import libraries
import pandas as pd
import sqlite3

In [4]:
#df = pd.DataFrame(#data here :/)

df = pd.DataFrame({'name': ['Juan', 'Victoria', 'Mary'], \
'age': [23, 34, 43], 'city': ['Miami', 'Buenos Aries', 'Santiago']})

In [5]:
df

       name  age          city
0      Juan   23         Miami
1  Victoria   34  Buenos Aries
2      Mary   43      Santiago

In [7]:
#We will sqlite3 library and create a connection
cnn = sqlite3.connect('jupyter_sql_tutorial.db')

In [11]:
df.to_sql('people', cnn)

In [12]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [15]:
%sql sqlite:///jupyter_sql_tutorial.db

In [17]:
%%sql
SELECT *
FROM people

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(0, 'Juan', 23, 'Miami'),
 (1, 'Victoria', 34, 'Buenos Aries'),
 (2, 'Mary', 43, 'Santiago')]

In [18]:
%%sql
SELECT count(*)
FROM people

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(3,)]

In [19]:
%%sql
SELECT sum(age) as 'age_sum'
FROM people

 * sqlite:///jupyter_sql_tutorial.db
Done.

[(100,)]

## Parameters walkthrough

In [20]:
#create dummy dataframe
df = pd.DataFrame({'transaction_id': ['9', '8', '7', '6', '5', '4', '3'], \
                  'user_id': ['rafa', 'roy', 'kenny', 'brendan', 'jurgen', 'roy', 'roy'],\
                  'transaction_date': ['2021-12-21', '2020-12-21', '2019-12-21',\
                                       '2018-11-21', '2017-10-21', '2019-03-02', '2010-01-01'],\
                  'amount': ['10', '15', '20', '24', '25', '31', '42']})

In [21]:
df

  transaction_id  user_id transaction_date amount
0              9     rafa       2021-12-21     10
1              8      roy       2020-12-21     15
2              7    kenny       2019-12-21     20
3              6  brendan       2018-11-21     24
4              5   jurgen       2017-10-21     25
5              4      roy       2019-03-02     31
6              3      roy       2010-01-01     42

In [22]:
#We will sqlite3 library and create a connection
cnn = sqlite3.connect('dummy.db')

In [29]:
df.to_sql('managers1', cnn)

In [30]:
%reload_ext sql

In [31]:
%sql sqlite:///dummy.db

In [32]:
%%sql
SELECT *
FROM managers1

 * sqlite:///dummy.db
Done.

[(0, '9', 'rafa', '2021-12-21', '10'),
 (1, '8', 'roy', '2020-12-21', '15'),
 (2, '7', 'kenny', '2019-12-21', '20'),
 (3, '6', 'brendan', '2018-11-21', '24'),
 (4, '5', 'jurgen', '2017-10-21', '25'),
 (5, '4', 'roy', '2019-03-02', '31'),
 (6, '3', 'roy', '2010-01-01', '42')]

In [34]:
%%sql
SELECT sum(amount) as 'spend_sum'
FROM managers1

 * sqlite:///dummy.db
Done.

[(167,)]

In [35]:
%%sql
SELECT 
    user_id
    , count(*) as num_transactions
    , sum(amount) as total_amount
FROM
    managers1
WHERE
    user_id = 'roy'
    and transaction_date = '2019-03-02'

 * sqlite:///dummy.db
Done.

[('roy', 1, 31)]

## For real this time

ovechal01, ovi8

1228 * 11,

In [1]:
#import libraries
import pandas as pd
import sqlite3

In [2]:
stat_handle = input('stat handle:')
stat_sheet = f'./data/{stat_handle}_stats.csv'
stat_df = pd.read_csv(stat_sheet, sep= '\t', header= 0, index_col= None)

stat handle:carrico01

In [3]:
stat_df

,date,goals,assists,+/-,pim,shots,shot%,TOI,hits,blocks,faceoff %
0,2013-10-01,0,0,-2,2,0,NaN,10:45,2,0,NaN
1,2013-10-03,1,0,0,2,4,25.0,17:26,2,0,NaN
2,2013-10-05,0,0,0,2,1,0.0,12:41,0,1,NaN
3,2014-01-09,0,0,-1,0,0,NaN,12:59,1,2,NaN
4,2014-01-10,0,0,0,0,1,0.0,13:37,3,0,NaN
...,...,...,...,...,...,...,...,...,...,...,...
236,2021-04-29,0,0,1,5,0,NaN,19:19,1,2,NaN
237,2021-05-01,0,0,2,0,0,NaN,19:16,0,4,NaN
238,2021-05-03,0,0,-2,0,1,0.0,18:02,0,1,NaN
239,2021-05-04,0,0,-1,0,1,0.0,19:30,0,1,NaN
240,2021-05-06,0,0,-1,0,1,0.0,18:16,1,2,NaN

In [4]:
stat_handle = input('twitter handle:')
stat_sheet = f'./data/{stat_handle}.csv'
twitter_df = pd.read_csv(stat_sheet, sep= '\t', header= 0, index_col= None)

twitter handle:connorcarrick

In [5]:
twitter_df

,date,time,display name,content
0,2021-12-20,00:58:34+00:00,Connor Carrick,@jpolly22 Happened to me in TO. Next level stu...
1,2021-12-12,14:42:59+00:00,Connor Carrick,Little chalk goes a long way. Wind was helping...
2,2021-12-11,14:01:08+00:00,Connor Carrick,@racheldoerrie Two sides of the same coin-the ...
3,2021-12-01,20:35:35+00:00,Connor Carrick,"@LKemp42 And by honestly, I mean dishonestly. ..."
4,2021-11-24,18:52:09+00:00,Connor Carrick,@DimFilipovic What a treat to watch this today
...,...,...,...,...
6990,2011-08-19,04:58:27+00:00,Connor Carrick,@IanBrady1 how was piestany bro #thefoodsucked
6991,2011-08-19,04:51:00+00:00,Connor Carrick,"@psieloff94 pat, his name is martin st. louis ..."
6992,2011-08-19,04:42:23+00:00,Connor Carrick,@psieloff94 i block shots like its my job #cal...
6993,2011-08-19,04:22:38+00:00,Connor Carrick,@filthyGRINDer9 haha i got mine done yesterday...
6994,2011-08-18,17:55:32+00:00,Connor Carrick,@MilesKoules forehand backhand upstairs #where...

In [6]:
game_list = []
gm_dates = stat_df.iloc[:,0]
for gm in gm_dates:
    game_list.append(gm)
    
print(len(game_list))

241

In [7]:
data_points = []
post_game = 0
tweet_dates = twitter_df.iloc[:,0]
tweet_times = twitter_df.iloc[:,1]
for gm, tm in zip(tweet_dates, tweet_times):
    if gm in game_list:
        
        hr = int(tm[:2])
        if hr < 19:
            data_points.append(gm)
        else:
            post_game += 1

print(f'{len(data_points)} good points of data, {post_game} postgame tweets')

105 good points of data, 8 postgame tweets

In [10]:
import pandas as pd

data_points = []
post_game = 0
tweet_dates = twitter_df.iloc[:,0]
#tweet_times = twitter_df.iloc[:,1]
for gm in tweet_dates:
    ymd = gm[:10]
    if ymd in game_list:
        gm_time = f'{ymd} 00:00:00-05:00'
        gm_time = pd.to_datetime(gm_time)
        gm = pd.to_datetime(gm)
        #hr = int(tm[:2])
        print(gm)
        '''
        if gm < gm_time:
            data_points.append(gm)
        else:
            post_game += 1
        '''

print(f'{len(data_points)} good points of data, {post_game} postgame tweets')

2021-05-04 00:00:00
2021-05-01 00:00:00
2021-04-24 00:00:00
2021-04-20 00:00:00
2020-03-07 00:00:00
2020-02-04 00:00:00
2020-02-01 00:00:00
2020-01-12 00:00:00
2019-04-04 00:00:00
2019-03-29 00:00:00
2019-03-02 00:00:00
2018-04-05 00:00:00
2018-04-05 00:00:00
2018-03-20 00:00:00
2018-03-17 00:00:00
2018-03-05 00:00:00
2018-02-27 00:00:00
2018-02-22 00:00:00
2018-02-22 00:00:00
2018-02-03 00:00:00
2018-02-03 00:00:00
2018-01-31 00:00:00
2018-01-25 00:00:00
2018-01-24 00:00:00
2018-01-06 00:00:00
2017-12-23 00:00:00
2017-12-23 00:00:00
2017-11-24 00:00:00
2017-11-22 00:00:00
2017-11-01 00:00:00
2017-02-14 00:00:00
2017-02-07 00:00:00
2017-02-06 00:00:00
2017-02-06 00:00:00
2017-02-06 00:00:00
2017-02-06 00:00:00
2017-01-25 00:00:00
2017-01-14 00:00:00
2017-01-06 00:00:00
2017-01-01 00:00:00
2016-12-22 00:00:00
2016-12-17 00:00:00
2016-12-15 00:00:00
2016-11-03 00:00:00
2016-11-03 00:00:00
2016-11-03 00:00:00
2016-11-03 00:00:00
2016-11-03 00:00:00
2016-03-03 00:00:00
2014-04-13 00:00:00
2014-04-13 00:00:00
2014-04-13 00:00:00
2014-04-13 00:00:00
2014-04-11 00:00:00
2014-04-11 00:00:00
2014-04-10 00:00:00
2014-04-10 00:00:00
2014-04-10 00:00:00
2014-04-10 00:00:00
2014-04-08 00:00:00
2014-04-08 00:00:00
2014-03-16 00:00:00
2014-03-14 00:00:00
2014-03-11 00:00:00
2014-03-11 00:00:00
2014-03-10 00:00:00
2014-03-10 00:00:00
2014-03-10 00:00:00
2014-03-06 00:00:00
2014-03-06 00:00:00
2014-03-05 00:00:00
2014-03-05 00:00:00
2014-03-05 00:00:00
2014-03-05 00:00:00
2014-03-05 00:00:00
2014-03-05 00:00:00
2014-03-05 00:00:00
2014-03-05 00:00:00
2014-03-05 00:00:00
2014-03-05 00:00:00
2014-03-05 00:00:00
2014-03-05 00:00:00
2014-03-05 00:00:00
2014-03-05 00:00:00
2014-03-05 00:00:00
2014-03-05 00:00:00
2014-03-01 00:00:00
2014-03-01 00:00:00
2014-03-01 00:00:00
2014-02-27 00:00:00
2014-02-08 00:00:00
2014-02-08 00:00:00
2014-02-06 00:00:00
2014-02-06 00:00:00
2014-02-06 00:00:00
2014-02-04 00:00:00
2014-02-02 00:00:00
2014-02-02 00:00:00
2014-01-31 00:00:00
2014-01-28 00:00:00
2014-01-28 00:00:00
2014-01-21 00:00:00
2014-01-19 00:00:00
2014-01-19 00:00:00
2014-01-17 00:00:00
2014-01-17 00:00:00
2014-01-15 00:00:00
2013-10-05 00:00:00
2013-10-03 00:00:00
2013-10-03 00:00:00
2013-10-03 00:00:00
2013-10-01 00:00:00
2013-10-01 00:00:00
0 good points of data, 0 postgame tweets

In [8]:
for d in data_points:
    print(d)

2014-03-18 00:49:01-04:00
2013-03-24 00:03:45-04:00
2013-03-14 00:04:50-04:00
2013-03-14 00:00:46-04:00

Maybe need to include puck drop times? Would require altering stat scraper, and likely slowing it down signifigantly, to the magnitute of rendering an entire new webpage in beautfiul soup per row in the dataset. For Ovechkin this would include 1228 pages! Maybe I should use selenium as an alternative. However at least for Ovechkin, no gameday tweets were scheduled for 7pm EST. BRB Looking at tweet timestamps

In [9]:
for point in data_points:
    print(point)